nsec/nsec-badge/nrf52/src/drivers/ws2812fx.c
/*
  WS2812FX.cpp - Library for WS2812 LED effects.

  Harm Aldick - 2016
  www.aldick.org


  FEATURES
    * A lot of blinken modes and counting
    * WS2812FX can be used as drop-in replacement for Adafruit NeoPixel Library

  NOTES
    * Uses the Adafruit NeoPixel library. Get it here:
      https://github.com/adafruit/Adafruit_NeoPixel



  LICENSE

  The MIT License (MIT)

  Copyright (c) 2016  Harm Aldick

  Permission is hereby granted, free of charge, to any person obtaining a copy
  of this software and associated documentation files (the "Software"), to deal
  in the Software without restriction, including without limitation the rights
  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
  copies of the Software, and to permit persons to whom the Software is
  furnished to do so, subject to the following conditions:

  The above copyright notice and this permission notice shall be included in
  all copies or substantial portions of the Software.

  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
  THE SOFTWARE.


  CHANGELOG

  2016-05-28   Initial beta release
  2016-06-03   Code cleanup, minor improvements, new modes
  2016-06-04   2 new fx, fixed setColor (now also resets _mode_color)
  2017-02-02   added external trigger functionality (e.g. for sound-to-light)
  2017-02-02   removed "blackout" on mode, speed or color-change
  2017-09-26   implemented segment and reverse features
  2017-11-16   changed speed calc, reduced memory footprint
  2018-02-24   added hooks for user created custom effects
*/

#include "ws2812fx.h"
#include "app/timer.h"
#include "app/utils.h"
#include "led_effects.h"
#include <arm_math.h>
#include <nrf.h>
#include <nrf_delay.h>
#include <stdlib.h>
#include <string.h>

static uint16_t mode_static(void);
static uint16_t blink(uint32_t, uint32_t, bool strobe);
static uint16_t mode_blink(void);
static uint16_t mode_blink_rainbow(void);
static uint16_t mode_strobe(void);
static uint16_t mode_strobe_rainbow(void);
static uint16_t color_wipe(uint32_t, uint32_t, bool);
static uint16_t mode_color_wipe(void);
static uint16_t mode_color_wipe_inv(void);
static uint16_t mode_color_wipe_rev(void);
static uint16_t mode_color_wipe_rev_inv(void);
static uint16_t mode_color_wipe_random(void);
static uint16_t mode_color_sweep_random(void);
static uint16_t mode_random_color(void);
static uint16_t mode_single_dynamic(void);
static uint16_t mode_multi_dynamic(void);
static uint16_t mode_breath(void);
static uint16_t mode_fade(void);
static uint16_t mode_scan(void);
static uint16_t mode_dual_scan(void);
static uint16_t theater_chase(uint32_t, uint32_t);
static uint16_t mode_theater_chase(void);
static uint16_t mode_theater_chase_rainbow(void);
static uint16_t mode_rainbow(void);
static uint16_t mode_rainbow_cycle(void);
static uint16_t mode_running_lights(void);
static uint16_t twinkle(uint32_t);
static uint16_t mode_twinkle(void);
static uint16_t mode_twinkle_random(void);
static uint16_t twinkle_fade(uint32_t);
static uint16_t mode_twinkle_fade(void);
static uint16_t mode_twinkle_fade_random(void);
static uint16_t mode_sparkle(void);
static uint16_t mode_flash_sparkle(void);
static uint16_t mode_hyper_sparkle(void);
static uint16_t mode_multi_strobe(void);
static uint16_t chase(uint32_t, uint32_t, uint32_t);
static uint16_t mode_chase_white(void);
static uint16_t mode_chase_color(void);
static uint16_t mode_chase_random(void);
static uint16_t mode_chase_rainbow(void);
static uint16_t mode_chase_flash(void);
static uint16_t mode_chase_flash_random(void);
static uint16_t mode_chase_rainbow_white(void);
static uint16_t mode_chase_blackout(void);
static uint16_t mode_chase_blackout_rainbow(void);
static uint16_t running(uint32_t, uint32_t);
static uint16_t mode_running_color(void);
static uint16_t mode_running_red_blue(void);
static uint16_t mode_running_random(void);
static uint16_t mode_larson_scanner(void);
static uint16_t mode_comet(void);
static uint16_t fireworks(uint32_t);
static uint16_t mode_fireworks(void);
static uint16_t mode_fireworks_random(void);
static uint16_t mode_merry_christmas(void);
static uint16_t mode_halloween(void);
static uint16_t mode_fire_flicker(void);
static uint16_t mode_fire_flicker_soft(void);
static uint16_t mode_fire_flicker_intense(void);
static uint16_t fire_flicker(int);
static uint16_t mode_circus_combustus(void);
static uint16_t tricolor_chase(uint32_t, uint32_t, uint32_t);
static uint16_t mode_bicolor_chase(void);
static uint16_t mode_tricolor_chase(void);
static uint16_t mode_icu(void);
static uint16_t mode_custom(void);

typedef uint16_t (*mode_func_t)(void);

static mode_func_t modes[] = {
    mode_static,
    mode_blink,
    mode_breath,
    mode_color_wipe,
    mode_color_wipe_inv,
    mode_color_wipe_rev,
    mode_color_wipe_rev_inv,
    mode_color_wipe_random,
    mode_random_color,
    mode_single_dynamic,
    mode_multi_dynamic,
    mode_rainbow,
    mode_rainbow_cycle,
    mode_scan,
    mode_dual_scan,
    mode_fade,
    mode_theater_chase,
    mode_theater_chase_rainbow,
    mode_running_lights,
    mode_twinkle,
    mode_twinkle_random,
    mode_twinkle_fade,
    mode_twinkle_fade_random,
    mode_sparkle,
    mode_flash_sparkle,
    mode_hyper_sparkle,
    mode_strobe,
    mode_strobe_rainbow,
    mode_multi_strobe,
    mode_blink_rainbow,
    mode_chase_white,
    mode_chase_color,
    mode_chase_random,
    mode_chase_rainbow,
    mode_chase_flash,
    mode_chase_flash_random,
    mode_chase_rainbow_white,
    mode_chase_blackout,
    mode_chase_blackout_rainbow,
    mode_color_sweep_random,
    mode_running_color,
    mode_running_red_blue,
    mode_running_random,
    mode_larson_scanner,
    mode_comet,
    mode_fireworks,
    mode_fireworks_random,
    mode_merry_christmas,
    mode_fire_flicker,
    mode_fire_flicker_soft,
    mode_fire_flicker_intense,
    mode_circus_combustus,
    mode_halloween,
    mode_bicolor_chase,
    mode_tricolor_chase,
    mode_icu,
    mode_custom,
};

static const char *name[] = {
    "Static",
    "Blink",
    "Breath",
    "Color Wipe",
    "Color Wipe Inverse",
    "Color Wipe Reverse",
    "Color Wipe Reverse Inverse",
    "Color Wipe Random",
    "Random Color",
    "Single Dynamic",
    "Multi Dynamic",
    "Rainbow",
    "Rainbow Cycle",
    "Scan",
    "Dual Scan",
    "Fade",
    "Theater Chase",
    "Theater Chase Rainbow",
    "Running Lights",
    "Twinkle",
    "Twinkle Random",
    "Twinkle Fade",
    "Twinkle Fade Random",
    "Sparkle",
    "Flash Sparkle",
    "Hyper Sparkle",
    "Strobe",
    "Strobe Rainbow",
    "Multi Strobe",
    "Blink Rainbow",
    "Chase White",
    "Chase Color",
    "Chase Random",
    "Chase Rainbow",
    "Chase Flash",
    "Chase Flash Random",
    "Chase Rainbow White",
    "Chase Blackout",
    "Chase Blackout Rainbow",
    "Color Sweep Random",
    "Running Color",
    "Running Red Blue",
    "Running Random",
    "Larson Scanner",
    "Comet",
    "Fireworks",
    "Fireworks Random",
    "Merry Christmas",
    "Fire Flicker",
    "Fire Flicker (soft)",
    "Fire Flicker (intense)",
    "Circus Combustus",
    "Halloween",
    "Bicolor Chase",
    "Tricolor Chase",
    "ICU",
    "Custom",
};

static uint32_t SPEED_MAX = 65535;

// Macro to increase readability
#define SEGMENT g_fx.segments[g_fx.segment_index]
#define SEGMENT_RUNTIME g_fx.segment_runtimes[g_fx.segment_index]
#define SEGMENT_LENGTH (SEGMENT.stop - SEGMENT.start + 1)
#define RESET_RUNTIME                                                          \
    memset(g_fx.segment_runtimes, 0, sizeof(g_fx.segment_runtimes))

// segment runtime parameters
typedef struct Segment_runtime { // 16 bytes
    unsigned long next_time;
    uint32_t counter_mode_step;
    uint32_t counter_mode_call;
    uint16_t aux_param;
    uint16_t aux_param2;
} segment_runtime;

typedef struct WS2812FX {
    bool running;
    bool triggered;
    uint8_t brightness;
    uint8_t num_segments;
    uint8_t segment_index;
    segment segments[MAX_NUM_SEGMENTS];
    segment_runtime segment_runtimes[MAX_NUM_SEGMENTS];
} ws2812fx;

static ws2812fx g_fx;

