nsec/nsec-badge/nrf52/src/drivers/ws2812fx.c
void init_WS2812FX(void)
{
    static bool init = false;
    ASSERT(!init);
    init = true;

    ws2812fx *fx = &g_fx;

    memset(fx, 0, sizeof(*fx));

    g_fx.brightness = DEFAULT_BRIGHTNESS;
    g_fx.running = false;
    g_fx.triggered = false;
    g_fx.num_segments = 1;

    for (int i = 0; i < MAX_NUM_SEGMENTS; i++) {
        g_fx.segments[i].mode = DEFAULT_MODE;
        g_fx.segments[i].start = 0;
        g_fx.segments[i].stop = NEOPIXEL_COUNT - 1;
        g_fx.segments[i].speed = DEFAULT_SPEED;
        for (int k = 0; k < NUM_COLORS; k++) {
            g_fx.segments[i].colors[k] = DEFAULT_COLOR;
        }
    }

    RESET_RUNTIME;
    nsec_neoPixel_init();
    setBrightness_WS2812FX(g_fx.brightness);
    nsec_neoPixel_show();
}

void service_WS2812FX(void)
{
    if (g_fx.running || g_fx.triggered) {
        uint64_t now = get_current_time_millis();
        bool doShow = false;
        for (uint8_t i = 0; i < g_fx.num_segments; i++) {
            g_fx.segment_index = i;
            if (now > SEGMENT_RUNTIME.next_time || g_fx.triggered) {
                doShow = true;
                uint16_t delay = modes[SEGMENT.mode]();
                SEGMENT_RUNTIME.next_time = now + max((int)delay, SPEED_MIN);
                SEGMENT_RUNTIME.counter_mode_call++;
            }
        }
        if (doShow) {
            nrf_delay_ms(1);
            nsec_neoPixel_show();
        }
        g_fx.triggered = false;
    }
}

void start_WS2812FX(void)
{
    RESET_RUNTIME;
    g_fx.running = true;
}

void stop_WS2812FX(void)
{
    g_fx.running = false;
    nsec_neoPixel_clear();
    nsec_neoPixel_show();
}

void trigger_WS2812FX(void)
{
    g_fx.triggered = true;
}

void setMode_WS2812FX(uint8_t m) {
    RESET_RUNTIME;
    g_fx.segments[0].mode = constrain(m, 0, MODE_COUNT - 1);
    setBrightness_WS2812FX(g_fx.brightness);
}

void setSegmentMode_WS2812FX(uint8_t segment_index, uint8_t m) {
    if (segment_index < g_fx.num_segments) {
        RESET_RUNTIME;
        g_fx.segments[segment_index].mode = constrain(m, 0, MODE_COUNT - 1);
        setBrightness_WS2812FX(g_fx.brightness);
    }
}

void setSpeed_WS2812FX(uint16_t s) {
    RESET_RUNTIME;
    g_fx.segments[0].speed = constrain(s, SPEED_MIN, SPEED_MAX);
}

void setReverse_WS2812FX(bool reverse) {
    RESET_RUNTIME;
    g_fx.segments[0].reverse = reverse;
}

void setSegmentReverse_WS2812FX(uint8_t segment_index, bool reverse) {
    if (segment_index < g_fx.num_segments) {
        RESET_RUNTIME;
        g_fx.segments[segment_index].reverse = reverse;
    }
}

bool getSegmentReverse_WS2812FX(uint8_t segment_index) {
    if (segment_index < g_fx.num_segments) {
        return g_fx.segments[segment_index].reverse;
    }
    return 0;
}

uint8_t getSegmentStart_WS2812FX(uint8_t segment_index) {
    if (segment_index < g_fx.num_segments) {
        return g_fx.segments[segment_index].start;
    }
    return 0;
}

void setSegmentStart_WS2812FX(uint8_t segment_index, uint8_t start) {
    if (segment_index < g_fx.num_segments) {
        g_fx.segments[segment_index].start = start;
    }
}
uint8_t getSegmentStop_WS2812FX(uint8_t segment_index) {
    if (segment_index < g_fx.num_segments) {
        return g_fx.segments[segment_index].stop;
    }
    return 0;
}

void setSegmentStop_WS2812FX(uint8_t segment_index, uint8_t stop) {
    if (segment_index < g_fx.num_segments) {
        g_fx.segments[segment_index].stop = stop;
    }
}

const char* getSegmentModeString_WS2812FX(uint8_t segment_index) {
    if (segment_index < g_fx.num_segments) {
        return name[g_fx.segments[segment_index].mode];
    }
    return "Unknown";
}

uint16_t getSegmentSpeed_WS2812FX(uint8_t segment_index) {
    if (segment_index < g_fx.num_segments) {
        return g_fx.segments[segment_index].speed;
    }
    return 0;
}

void setSegmentSpeed_WS2812FX(uint8_t segment_index, uint16_t segment_speed) {
    if (segment_index < g_fx.num_segments) {
        g_fx.segments[segment_index].speed = segment_speed;
    }
}

uint16_t getSegmentColor_WS2812FX(uint8_t segment_index, uint8_t color_index) {
    if (segment_index < g_fx.num_segments) {
        return g_fx.segments[segment_index].colors[color_index];
    }
    return 0;
}

void increaseSpeed_WS2812FX(uint8_t s) {
    uint16_t newSpeed = constrain(SEGMENT.speed + s, SPEED_MIN, SPEED_MAX);
    setSpeed_WS2812FX(newSpeed);
}

void decreaseSpeed_WS2812FX(uint8_t s) {
    uint16_t newSpeed = constrain(SEGMENT.speed - s, SPEED_MIN, SPEED_MAX);
    setSpeed_WS2812FX(newSpeed);
}

void setArrayColor_WS2812FX(uint8_t r, uint8_t g, uint8_t b, uint8_t index) {
    if (index < NUM_COLORS) {
        setArrayColor_packed_WS2812FX(
            ((uint32_t)r << 16) | ((uint32_t)g << 8) | b, index);
    }
}

void setColor_WS2812FX(uint8_t r, uint8_t g, uint8_t b) {
    setColor_packed_WS2812FX(((uint32_t)r << 16) | ((uint32_t)g << 8) | b);
}

void setArrayColor_packed_WS2812FX(uint32_t c, uint8_t index) {
    if (index < NUM_COLORS) {
        RESET_RUNTIME;
        g_fx.segments[0].colors[index] = c;
        setBrightness_WS2812FX(g_fx.brightness);
    }
}

void setSegmentArrayColor_packed_WS2812FX(uint8_t segment_index,
                                          uint8_t color_index, uint32_t c)
{
    if (color_index < NUM_COLORS && segment_index < g_fx.num_segments) {
        RESET_RUNTIME;
        g_fx.segments[segment_index].colors[color_index] = c;
        setBrightness_WS2812FX(g_fx.brightness);
    }
}

void setColor_packed_WS2812FX(uint32_t c) {
    RESET_RUNTIME;
    g_fx.segments[0].colors[0] = c;
    setBrightness_WS2812FX(g_fx.brightness);
}

void setBrightness_WS2812FX(uint8_t b) {
    g_fx.brightness = constrain(b, BRIGHTNESS_MIN, BRIGHTNESS_MAX);
    nsec_neoPixel_set_brightness(g_fx.brightness);
    nsec_neoPixel_show();
    nrf_delay_ms(1);
}

void increaseBrightness_WS2812FX(uint8_t s) {
    s = constrain(g_fx.brightness + s, BRIGHTNESS_MIN, BRIGHTNESS_MAX);
    setBrightness_WS2812FX(s);
}

void decreaseBrightness_WS2812FX(uint8_t s) {
    s = constrain(g_fx.brightness - s, BRIGHTNESS_MIN, BRIGHTNESS_MAX);
    setBrightness_WS2812FX(s);
}

bool isRunning_WS2812FX(void)
{
    return g_fx.running;
}

uint8_t getMode_WS2812FX(void)
{
    return g_fx.segments[0].mode;
}

uint16_t getSpeed_WS2812FX(void)
{
    return g_fx.segments[0].speed;
}

bool getReverse_WS2812FX(void)
{
    return g_fx.segments[0].reverse;
}

