nsec/nsec-badge/nrf52/src/drivers/ws2812fx.c
uint8_t getBrightness_WS2812FX(void)
{
    return g_fx.brightness;
}

uint16_t getLength_WS2812FX(void) {
    return g_fx.segments[0].stop - g_fx.segments[0].start + 1;
}

uint8_t getModeCount_WS2812FX(void) { return MODE_COUNT; }

uint8_t getNumSegments_WS2812FX(void)
{
    return g_fx.num_segments;
}

void setNumSegments_WS2812FX(uint8_t n) {
    RESET_RUNTIME;
    g_fx.num_segments = n;
}

uint32_t getColor_WS2812FX(void)
{
    return g_fx.segments[0].colors[0];
}

uint32_t getArrayColor_WS2812FX(uint8_t index) {
    if (index < NUM_COLORS) {
        return g_fx.segments[0].colors[index];
    } else {
        return getColor_WS2812FX();
    }
}

const char *getModeName_WS2812FX(uint8_t m) {
    if (m < MODE_COUNT) {
        return name[m];
    } else {
        return "Unknown";
    }
}

void setSegment_WS2812FX(uint8_t n, uint16_t start, uint16_t stop, uint8_t mode,
                         uint32_t color, uint16_t speed, bool reverse) {
    if (n < (sizeof(g_fx.segments) / sizeof(g_fx.segments[0]))) {
        if (n + 1 > g_fx.num_segments)
            g_fx.num_segments = n + 1;
        g_fx.segments[n].start = start;
        g_fx.segments[n].stop = stop;
        g_fx.segments[n].mode = mode;
        g_fx.segments[n].speed = speed;
        g_fx.segments[n].reverse = reverse;
        g_fx.segments[n].colors[0] = color;
    }
}

void setSegment_color_array_WS2812FX(uint8_t n, uint16_t start, uint16_t stop,
                                     uint8_t mode, const uint32_t colors[],
                                     uint16_t speed, bool reverse) {
    if (n < (sizeof(g_fx.segments) / sizeof(g_fx.segments[0]))) {
        if (n + 1 > g_fx.num_segments)
            g_fx.num_segments = n + 1;
        g_fx.segments[n].start = start;
        g_fx.segments[n].stop = stop;
        g_fx.segments[n].mode = mode;
        g_fx.segments[n].speed = speed;
        g_fx.segments[n].reverse = reverse;

        for (uint8_t i = 0; i < NUM_COLORS; i++) {
            g_fx.segments[n].colors[i] = colors[i];
        }
    }
}

void resetSegments_WS2812FX(void)
{
    memset(g_fx.segments, 0, sizeof(g_fx.segments));
    memset(g_fx.segment_runtimes, 0, sizeof(g_fx.segment_runtimes));
    g_fx.segment_index = 0;
    g_fx.num_segments = 1;
    setSegment_WS2812FX(0, 0, NEOPIXEL_COUNT, FX_MODE_STATIC, DEFAULT_COLOR,
                        DEFAULT_SPEED, false);
}

void moveSegment_WS2812FX(uint8_t src, uint8_t dest) {
    g_fx.segments[dest] = g_fx.segments[src];
}

/* #####################################################
#
#  Color and Blinken Functions
#
##################################################### */

/*
 * Put a value 0 to 255 in to get a color value.
 * The colours are a transition r -> g -> b -> back to r
 * Inspired by the Adafruit examples.
 */
static uint32_t color_wheel(uint8_t pos)
{
    pos = 255 - pos;
    if (pos < 85) {
        return ((uint32_t)(255 - pos * 3) << 16) | ((uint32_t)(0) << 8) |
               (pos * 3);
    } else if (pos < 170) {
        pos -= 85;
        return ((uint32_t)(0) << 16) | ((uint32_t)(pos * 3) << 8) |
               (255 - pos * 3);
    } else {
        pos -= 170;
        return ((uint32_t)(pos * 3) << 16) | ((uint32_t)(255 - pos * 3) << 8) |
               (0);
    }
}

/*
 * Returns a new, random wheel index with a minimum distance of 42 from pos.
 */
static uint8_t get_random_wheel_index(uint8_t pos)
{
    uint8_t r = 0;
    uint8_t x = 0;
    uint8_t y = 0;
    uint8_t d = 0;

    while (d < 42) {
        r = nsec_random_get_byte(255);
        x = abs(pos - r);
        y = 255 - x;
        d = min(x, y);
    }

    return r;
}

/*
 * No blinking. Just plain old static light.
 */
static uint16_t mode_static(void)
{
    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color_packed(i, SEGMENT.colors[0]);
    }
    return 500;
}

/*
 * Blink/strobe function
 * Alternate between color1 and color2
 * if(strobe == true) then create a strobe effect
 */

static uint16_t blink(uint32_t color1, uint32_t color2, bool strobe)
{
    uint32_t color =
        ((SEGMENT_RUNTIME.counter_mode_call & 1) == 0) ? color1 : color2;
    if (SEGMENT.reverse)
        color = (color == color1) ? color2 : color1;

    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color_packed(i, color);
    }

    if ((SEGMENT_RUNTIME.counter_mode_call & 1) == 0) {
        return strobe ? 20 : (SEGMENT.speed / 2);
    } else {
        return strobe ? SEGMENT.speed - 20 : (SEGMENT.speed / 2);
    }
}

/*
 * Normal blinking. 50% on/off time.
 */
static uint16_t mode_blink(void)
{
    return blink(SEGMENT.colors[0], SEGMENT.colors[1], false);
}

/*
 * Classic Blink effect. Cycling through the rainbow.
 */
static uint16_t mode_blink_rainbow(void)
{
    return blink(color_wheel(SEGMENT_RUNTIME.counter_mode_call & 0xFF),
                 SEGMENT.colors[1], false);
}

/*
 * Classic Strobe effect.
 */
static uint16_t mode_strobe(void)
{
    return blink(SEGMENT.colors[0], SEGMENT.colors[1], true);
}

/*
 * Classic Strobe effect. Cycling through the rainbow.
 */
static uint16_t mode_strobe_rainbow(void)
{
    return blink(color_wheel(SEGMENT_RUNTIME.counter_mode_call & 0xFF),
                 SEGMENT.colors[1], true);
}

/*
 * Color wipe function
 * LEDs are turned on (color1) in sequence, then turned off (color2) in
 * sequence. if (bool rev == true) then LEDs are turned off in reverse order
 */
static uint16_t color_wipe(uint32_t color1, uint32_t color2, bool rev)
{
    if (SEGMENT_RUNTIME.counter_mode_step < SEGMENT_LENGTH) {
        uint32_t led_offset = SEGMENT_RUNTIME.counter_mode_step;
        if (SEGMENT.reverse) {
            nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - led_offset,
                                                 color1);
        } else {
            nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + led_offset,
                                                 color1);
        }
    } else {
        uint32_t led_offset =
            SEGMENT_RUNTIME.counter_mode_step - SEGMENT_LENGTH;
        if ((SEGMENT.reverse && !rev) || (!SEGMENT.reverse && rev)) {
            nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - led_offset,
                                                 color2);
        } else {
            nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + led_offset,
                                                 color2);
        }
    }

    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) % (SEGMENT_LENGTH * 2);
    return (SEGMENT.speed / (SEGMENT_LENGTH * 2));
}

