nsec/nsec-badge/nrf52/src/drivers/ws2812fx.c
/*
 * Lights all LEDs one after another.
 */
static uint16_t mode_color_wipe(void)
{
    return color_wipe(SEGMENT.colors[0], SEGMENT.colors[1], false);
}

static uint16_t mode_color_wipe_inv(void)
{
    return color_wipe(SEGMENT.colors[1], SEGMENT.colors[0], false);
}

static uint16_t mode_color_wipe_rev(void)
{
    return color_wipe(SEGMENT.colors[0], SEGMENT.colors[1], true);
}

static uint16_t mode_color_wipe_rev_inv(void)
{
    return color_wipe(SEGMENT.colors[1], SEGMENT.colors[0], true);
}

/*
 * Turns all LEDs after each other to a random color.
 * Then starts over with another color.
 */
static uint16_t mode_color_wipe_random(void)
{
    if (SEGMENT_RUNTIME.counter_mode_step % SEGMENT_LENGTH ==
        0) { // aux_param will store our random color wheel index
        SEGMENT_RUNTIME.aux_param =
            get_random_wheel_index(SEGMENT_RUNTIME.aux_param);
    }
    uint32_t color = color_wheel(SEGMENT_RUNTIME.aux_param);
    return color_wipe(color, color, false) * 2;
}

/*
 * Random color introduced alternating from start and end of strip.
 */
static uint16_t mode_color_sweep_random(void)
{
    if (SEGMENT_RUNTIME.counter_mode_step % SEGMENT_LENGTH ==
        0) { // aux_param will store our random color wheel index
        SEGMENT_RUNTIME.aux_param =
            get_random_wheel_index(SEGMENT_RUNTIME.aux_param);
    }
    uint32_t color = color_wheel(SEGMENT_RUNTIME.aux_param);
    return color_wipe(color, color, true) * 2;
}

/*
 * Lights all LEDs in one random color up. Then switches them
 * to the next random color.
 */
static uint16_t mode_random_color(void)
{
    SEGMENT_RUNTIME.aux_param = get_random_wheel_index(
        SEGMENT_RUNTIME
            .aux_param); // aux_param will store our random color wheel index
    uint32_t color = color_wheel(SEGMENT_RUNTIME.aux_param);

    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color_packed(i, color);
    }
    return (SEGMENT.speed);
}

/*
 * Lights every LED in a random color. Changes one random LED after the other
 * to another random color.
 */
static uint16_t mode_single_dynamic(void)
{
    if (SEGMENT_RUNTIME.counter_mode_call == 0) {
        for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
            nsec_neoPixel_set_pixel_color_packed(
                i, color_wheel(nsec_random_get_byte(255)));
        }
    }
    nsec_neoPixel_set_pixel_color_packed(
        SEGMENT.start + nsec_random_get_byte(SEGMENT_LENGTH - 1),
        color_wheel(nsec_random_get_byte(255)));
    return (SEGMENT.speed);
}

/*
 * Lights every LED in a random color. Changes all LED at the same time
 * to new random colors.
 */
static uint16_t mode_multi_dynamic(void)
{
    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color_packed(
            i, color_wheel(nsec_random_get_byte(255)));
    }
    return (SEGMENT.speed);
}

/*
 * Does the "standby-breathing" of well known i-Devices. Fixed Speed.
 * Use mode "fade" if you like to have something similar with a different speed.
 */
static uint16_t mode_breath(void)
{
    //                                      0    1    2   3   4   5   6    7   8
    //                                      9  10  11   12   13   14   15   16
    //                                      // step
    uint16_t breath_delay_steps[] = {
        7,  9,  13, 15, 16, 17, 18, 930, 19,
        18, 15, 13, 9,  7,  4,  5,  10}; // magic numbers for breathing LED
    uint8_t breath_brightness_steps[] = {
        150, 125, 100, 75,  50,  25,  16,  15, 16,
        25,  50,  75,  100, 125, 150, 220, 255}; // even more magic numbers!

    if (SEGMENT_RUNTIME.counter_mode_call == 0) {
        SEGMENT_RUNTIME.aux_param =
            breath_brightness_steps[0] +
            1; // we use aux_param to store the brightness
    }

    uint8_t breath_brightness = SEGMENT_RUNTIME.aux_param;

    if (SEGMENT_RUNTIME.counter_mode_step < 8) {
        breath_brightness--;
    } else {
        breath_brightness++;
    }

    // update index of current delay when target brightness is reached, start
    // over after the last step
    if (breath_brightness ==
        breath_brightness_steps[SEGMENT_RUNTIME.counter_mode_step]) {
        SEGMENT_RUNTIME.counter_mode_step =
            (SEGMENT_RUNTIME.counter_mode_step + 1) %
            (sizeof(breath_brightness_steps) / sizeof(uint8_t));
    }

    int lum =
        map(breath_brightness, 0, 255, 0,
            g_fx.brightness); // keep luminosity below brightness set by user
    // uint8_t w = (SEGMENT.colors[0] >> 24 & 0xFF) * lum / _brightness; //
    // modify RGBW colors with brightness info
    uint8_t r = (SEGMENT.colors[0] >> 16 & 0xFF) * lum / g_fx.brightness;
    uint8_t g = (SEGMENT.colors[0] >> 8 & 0xFF) * lum / g_fx.brightness;
    uint8_t b = (SEGMENT.colors[0] & 0xFF) * lum / g_fx.brightness;
    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color(i, r, g, b);
    }

    SEGMENT_RUNTIME.aux_param = breath_brightness;
    return breath_delay_steps[SEGMENT_RUNTIME.counter_mode_step];
}

/*
 * Fades the LEDs on and (almost) off again.
 */
static uint16_t mode_fade(void)
{
    int lum = SEGMENT_RUNTIME.counter_mode_step - 31;
    lum = 63 - (abs(lum) * 2);
    lum = map(lum, 0, 64, min(25, (int)g_fx.brightness), g_fx.brightness);

    // uint8_t w = (SEGMENT.colors[0] >> 24 & 0xFF) * lum / _brightness; //
    // modify RGBW colors with brightness info
    uint8_t r = (SEGMENT.colors[0] >> 16 & 0xFF) * lum / g_fx.brightness;
    uint8_t g = (SEGMENT.colors[0] >> 8 & 0xFF) * lum / g_fx.brightness;
    uint8_t b = (SEGMENT.colors[0] & 0xFF) * lum / g_fx.brightness;
    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color(i, r, g, b);
    }

    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) % 64;
    return (SEGMENT.speed / 64);
}

/*
 * Runs a single pixel back and forth.
 */
static uint16_t mode_scan(void)
{
    if (SEGMENT_RUNTIME.counter_mode_step > (SEGMENT_LENGTH * 2) - 3) {
        SEGMENT_RUNTIME.counter_mode_step = 0;
    }

    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color_packed(i, BLACK);
    }

    int led_offset = SEGMENT_RUNTIME.counter_mode_step - (SEGMENT_LENGTH - 1);
    led_offset = abs(led_offset);

    if (SEGMENT.reverse) {
        nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - led_offset,
                                             SEGMENT.colors[0]);
    } else {
        nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + led_offset,
                                             SEGMENT.colors[0]);
    }

    SEGMENT_RUNTIME.counter_mode_step++;
    return (SEGMENT.speed / (SEGMENT_LENGTH * 2));
}

