nsec/nsec-badge/nrf52/src/drivers/ws2812fx.c
/*
 * Runs two pixel back and forth in opposite directions.
 */
static uint16_t mode_dual_scan(void)
{
    if (SEGMENT_RUNTIME.counter_mode_step > (SEGMENT_LENGTH * 2) - 3) {
        SEGMENT_RUNTIME.counter_mode_step = 0;
    }

    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color_packed(i, BLACK);
    }

    int led_offset = SEGMENT_RUNTIME.counter_mode_step - (SEGMENT_LENGTH - 1);
    led_offset = abs(led_offset);

    nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + led_offset,
                                         SEGMENT.colors[0]);
    nsec_neoPixel_set_pixel_color_packed(
        SEGMENT.start + SEGMENT_LENGTH - led_offset - 1, SEGMENT.colors[0]);

    SEGMENT_RUNTIME.counter_mode_step++;
    return (SEGMENT.speed / (SEGMENT_LENGTH * 2));
}

/*
 * Cycles all LEDs at once through a rainbow.
 */
static uint16_t mode_rainbow(void)
{
    uint32_t color = color_wheel(SEGMENT_RUNTIME.counter_mode_step);
    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color_packed(i, color);
    }

    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) & 0xFF;
    return (SEGMENT.speed / 256);
}

/*
 * Cycles a rainbow over the entire string of LEDs.
 */
static uint16_t mode_rainbow_cycle(void)
{
    for (uint16_t i = 0; i < SEGMENT_LENGTH; i++) {
        uint32_t color = color_wheel(
            ((i * 256 / SEGMENT_LENGTH) + SEGMENT_RUNTIME.counter_mode_step) &
            0xFF);
        nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + i, color);
    }

    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) & 0xFF;
    return (SEGMENT.speed / 256);
}

/*
 * theater chase function
 */
uint16_t theater_chase(uint32_t color1, uint32_t color2) {
    SEGMENT_RUNTIME.counter_mode_call = SEGMENT_RUNTIME.counter_mode_call % 3;
    for (uint16_t i = 0; i < SEGMENT_LENGTH; i++) {
        if ((i % 3) == SEGMENT_RUNTIME.counter_mode_call) {
            if (SEGMENT.reverse) {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - i, color1);
            } else {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + i, color1);
            }
        } else {
            if (SEGMENT.reverse) {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - i, color2);
            } else {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + i, color2);
            }
        }
    }

    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * Theatre-style crawling lights.
 * Inspired by the Adafruit examples.
 */
static uint16_t mode_theater_chase(void)
{
    return theater_chase(SEGMENT.colors[0], BLACK);
}

/*
 * Theatre-style crawling lights with rainbow effect.
 * Inspired by the Adafruit examples.
 */
static uint16_t mode_theater_chase_rainbow(void)
{
    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) & 0xFF;
    return theater_chase(color_wheel(SEGMENT_RUNTIME.counter_mode_step), BLACK);
}

/*
 * Running lights effect with smooth sine transition.
 */
static uint16_t mode_running_lights(void)
{
    // uint8_t w = ((SEGMENT.colors[0] >> 24) & 0xFF);
    uint8_t r = ((SEGMENT.colors[0] >> 16) & 0xFF);
    uint8_t g = ((SEGMENT.colors[0] >> 8) & 0xFF);
    uint8_t b = (SEGMENT.colors[0] & 0xFF);

    float radPerLed = (2.0 * 3.14159) / SEGMENT_LENGTH;
    for (uint16_t i = 0; i < SEGMENT_LENGTH; i++) {
        int lum =
            map((int)(arm_sin_f32((i + SEGMENT_RUNTIME.counter_mode_step) *
                                  radPerLed) *
                      128),
                -128, 128, 0, 255);
        if (SEGMENT.reverse) {
            nsec_neoPixel_set_pixel_color(SEGMENT.start + i, (r * lum) / 256,
                                          (g * lum) / 256, (b * lum) / 256);
        } else {
            nsec_neoPixel_set_pixel_color(SEGMENT.stop - i, (r * lum) / 256,
                                          (g * lum) / 256, (b * lum) / 256);
        }
    }
    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) % SEGMENT_LENGTH;
    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * twinkle function
 */
uint16_t twinkle(uint32_t color) {
    if (SEGMENT_RUNTIME.counter_mode_step == 0) {
        for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
            nsec_neoPixel_set_pixel_color_packed(i, BLACK);
        }
        uint16_t min_leds =
            max(1, SEGMENT_LENGTH / 5); // make sure, at least one LED is on
        uint16_t max_leds =
            max(1, SEGMENT_LENGTH / 2); // make sure, at least one LED is on
        SEGMENT_RUNTIME.counter_mode_step =
            nsec_random_get_byte_range(min_leds, max_leds - 1);
    }

    nsec_neoPixel_set_pixel_color_packed(
        SEGMENT.start + nsec_random_get_byte(SEGMENT_LENGTH - 1), color);

    SEGMENT_RUNTIME.counter_mode_step--;
    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * Blink several LEDs on, reset, repeat.
 * Inspired by www.tweaking4all.com/hardware/arduino/adruino-led-strip-effects/
 */
static uint16_t mode_twinkle(void)
{
    return twinkle(SEGMENT.colors[0]);
}

/*
 * Blink several LEDs in random colors on, reset, repeat.
 * Inspired by www.tweaking4all.com/hardware/arduino/adruino-led-strip-effects/
 */
static uint16_t mode_twinkle_random(void)
{
    return twinkle(color_wheel(nsec_random_get_byte(255)));
}

/*
 * fade out function
 * fades out the current segment by dividing each pixel's intensity by 2
 */
static void fade_out(void)
{
    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        uint32_t color = nsec_neoPixel_get_pixel_color(i);
        color = (color >> 1) & 0x7F7F7F7F;
        nsec_neoPixel_set_pixel_color_packed(i, color);
    }
}

/*
 * twinkle_fade function
 */
uint16_t twinkle_fade(uint32_t color) {
    fade_out();

    if (nsec_random_get_byte(2) == 0) {
        nsec_neoPixel_set_pixel_color_packed(
            SEGMENT.start + nsec_random_get_byte(SEGMENT_LENGTH - 1), color);
    }
    return (SEGMENT.speed / 8);
}

