nsec/nsec-badge/nrf52/src/drivers/ws2812fx.c
/*
 * Blink several LEDs on, fading out.
 */
static uint16_t mode_twinkle_fade(void)
{
    return twinkle_fade(SEGMENT.colors[0]);
}

/*
 * Blink several LEDs in random colors on, fading out.
 */
static uint16_t mode_twinkle_fade_random(void)
{
    return twinkle_fade(color_wheel(nsec_random_get_byte(255)));
}

/*
 * Blinks one LED at a time.
 * Inspired by www.tweaking4all.com/hardware/arduino/adruino-led-strip-effects/
 */
static uint16_t mode_sparkle(void)
{
    nsec_neoPixel_set_pixel_color_packed(
        SEGMENT.start + SEGMENT_RUNTIME.aux_param, BLACK);
    SEGMENT_RUNTIME.aux_param = nsec_random_get_byte(
        SEGMENT_LENGTH - 1); // aux_param stores the random led index
    nsec_neoPixel_set_pixel_color_packed(
        SEGMENT.start + SEGMENT_RUNTIME.aux_param, SEGMENT.colors[0]);
    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * Lights all LEDs in the color. Flashes single white pixels randomly.
 * Inspired by www.tweaking4all.com/hardware/arduino/adruino-led-strip-effects/
 */
static uint16_t mode_flash_sparkle(void)
{
    if (SEGMENT_RUNTIME.counter_mode_call == 0) {
        for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
            nsec_neoPixel_set_pixel_color_packed(i, SEGMENT.colors[0]);
        }
    }

    nsec_neoPixel_set_pixel_color_packed(
        SEGMENT.start + SEGMENT_RUNTIME.aux_param, SEGMENT.colors[0]);

    if (nsec_random_get_byte(4) == 0) {
        SEGMENT_RUNTIME.aux_param = nsec_random_get_byte(
            SEGMENT_LENGTH - 1); // aux_param stores the random led index
        nsec_neoPixel_set_pixel_color_packed(
            SEGMENT.start + SEGMENT_RUNTIME.aux_param, WHITE);
        return 20;
    }
    return SEGMENT.speed;
}

/*
 * Like flash sparkle. With more flash.
 * Inspired by www.tweaking4all.com/hardware/arduino/adruino-led-strip-effects/
 */
static uint16_t mode_hyper_sparkle(void)
{
    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color_packed(i, SEGMENT.colors[0]);
    }

    if (nsec_random_get_byte(4) < 2) {
        for (uint16_t i = 0; i < max(1, SEGMENT_LENGTH / 3); i++) {
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.start + nsec_random_get_byte(SEGMENT_LENGTH - 1),
                WHITE);
        }
        return 20;
    }
    return SEGMENT.speed;
}

/*
 * Strobe effect with different strobe count and pause, controlled by speed.
 */
static uint16_t mode_multi_strobe(void)
{
    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color_packed(i, BLACK);
    }

    uint16_t delay = SEGMENT.speed / (2 * ((SEGMENT.speed / 10) + 1));
    if (SEGMENT_RUNTIME.counter_mode_step < (2 * ((SEGMENT.speed / 10) + 1))) {
        if ((SEGMENT_RUNTIME.counter_mode_step & 1) == 0) {
            for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
                nsec_neoPixel_set_pixel_color_packed(i, SEGMENT.colors[0]);
            }
            delay = 20;
        } else {
            delay = 50;
        }
    }
    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) %
        ((2 * ((SEGMENT.speed / 10) + 1)) + 1);
    return delay;
}

/*
 * color chase function.
 * color1 = background color
 * color2 and color3 = colors of two adjacent leds
 */

uint16_t chase(uint32_t color1, uint32_t color2, uint32_t color3) {
    uint16_t a = SEGMENT_RUNTIME.counter_mode_step;
    uint16_t b = (a + 1) % SEGMENT_LENGTH;
    uint16_t c = (b + 1) % SEGMENT_LENGTH;
    if (SEGMENT.reverse) {
        nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - a, color1);
        nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - b, color2);
        nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - c, color3);
    } else {
        nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + a, color1);
        nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + b, color2);
        nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + c, color3);
    }

    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) % SEGMENT_LENGTH;
    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * Bicolor chase mode
 */
static uint16_t mode_bicolor_chase(void)
{
    return chase(SEGMENT.colors[0], SEGMENT.colors[1], SEGMENT.colors[2]);
}

/*
 * White running on _color.
 */
static uint16_t mode_chase_color(void)
{
    return chase(SEGMENT.colors[0], WHITE, WHITE);
}

/*
 * Black running on _color.
 */
static uint16_t mode_chase_blackout(void)
{
    return chase(SEGMENT.colors[0], BLACK, BLACK);
}

/*
 * _color running on white.
 */
static uint16_t mode_chase_white(void)
{
    return chase(WHITE, SEGMENT.colors[0], SEGMENT.colors[0]);
}

/*
 * White running followed by random color.
 */
static uint16_t mode_chase_random(void)
{
    if (SEGMENT_RUNTIME.counter_mode_step == 0) {
        SEGMENT_RUNTIME.aux_param =
            get_random_wheel_index(SEGMENT_RUNTIME.aux_param);
    }
    return chase(color_wheel(SEGMENT_RUNTIME.aux_param), WHITE, WHITE);
}

/*
 * Rainbow running on white.
 */
static uint16_t mode_chase_rainbow_white(void)
{
    uint16_t n = SEGMENT_RUNTIME.counter_mode_step;
    uint16_t m = (SEGMENT_RUNTIME.counter_mode_step + 1) % SEGMENT_LENGTH;
    uint32_t color2 = color_wheel(((n * 256 / SEGMENT_LENGTH) +
                                   (SEGMENT_RUNTIME.counter_mode_call & 0xFF)) &
                                  0xFF);
    uint32_t color3 = color_wheel(((m * 256 / SEGMENT_LENGTH) +
                                   (SEGMENT_RUNTIME.counter_mode_call & 0xFF)) &
                                  0xFF);

    return chase(WHITE, color2, color3);
}

/*
 * White running on rainbow.
 */
static uint16_t mode_chase_rainbow(void)
{
    uint8_t color_sep = 256 / SEGMENT_LENGTH;
    uint8_t color_index = SEGMENT_RUNTIME.counter_mode_call & 0xFF;
    uint32_t color = color_wheel(
        ((SEGMENT_RUNTIME.counter_mode_step * color_sep) + color_index) & 0xFF);

    return chase(color, WHITE, WHITE);
}

