nsec/nsec-badge/nrf52/src/drivers/ws2812fx.c
/*
 * Black running on rainbow.
 */
static uint16_t mode_chase_blackout_rainbow(void)
{
    uint8_t color_sep = 256 / SEGMENT_LENGTH;
    uint8_t color_index = SEGMENT_RUNTIME.counter_mode_call & 0xFF;
    uint32_t color = color_wheel(
        ((SEGMENT_RUNTIME.counter_mode_step * color_sep) + color_index) & 0xFF);

    return chase(color, BLACK, BLACK);
}

/*
 * White flashes running on _color.
 */
static uint16_t mode_chase_flash(void)
{
    static const uint8_t flash_count = 4;
    uint8_t flash_step =
        SEGMENT_RUNTIME.counter_mode_call % ((flash_count * 2) + 1);

    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        nsec_neoPixel_set_pixel_color_packed(i, SEGMENT.colors[0]);
    }

    uint16_t delay = (SEGMENT.speed / SEGMENT_LENGTH);
    if (flash_step < (flash_count * 2)) {
        if (flash_step % 2 == 0) {
            uint16_t n = SEGMENT_RUNTIME.counter_mode_step;
            uint16_t m =
                (SEGMENT_RUNTIME.counter_mode_step + 1) % SEGMENT_LENGTH;
            if (SEGMENT.reverse) {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - n, WHITE);
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - m, WHITE);
            } else {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + n, WHITE);
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + m, WHITE);
            }
            delay = 20;
        } else {
            delay = 30;
        }
    } else {
        SEGMENT_RUNTIME.counter_mode_step =
            (SEGMENT_RUNTIME.counter_mode_step + 1) % SEGMENT_LENGTH;
    }
    return delay;
}

/*
 * White flashes running, followed by random color.
 */
static uint16_t mode_chase_flash_random(void)
{
    static const uint8_t flash_count = 4;
    uint8_t flash_step =
        SEGMENT_RUNTIME.counter_mode_call % ((flash_count * 2) + 1);

    for (uint16_t i = 0; i < SEGMENT_RUNTIME.counter_mode_step; i++) {
        nsec_neoPixel_set_pixel_color_packed(
            SEGMENT.start + i, color_wheel(SEGMENT_RUNTIME.aux_param));
    }

    uint16_t delay = (SEGMENT.speed / SEGMENT_LENGTH);
    if (flash_step < (flash_count * 2)) {
        uint16_t n = SEGMENT_RUNTIME.counter_mode_step;
        uint16_t m = (SEGMENT_RUNTIME.counter_mode_step + 1) % SEGMENT_LENGTH;
        if (flash_step % 2 == 0) {
            nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + n, WHITE);
            nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + m, WHITE);
            delay = 20;
        } else {
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.start + n, color_wheel(SEGMENT_RUNTIME.aux_param));
            nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + m, BLACK);
            delay = 30;
        }
    } else {
        SEGMENT_RUNTIME.counter_mode_step =
            (SEGMENT_RUNTIME.counter_mode_step + 1) % SEGMENT_LENGTH;

        if (SEGMENT_RUNTIME.counter_mode_step == 0) {
            SEGMENT_RUNTIME.aux_param =
                get_random_wheel_index(SEGMENT_RUNTIME.aux_param);
        }
    }
    return delay;
}

/*
 * Alternating pixels running function.
 */
uint16_t running(uint32_t color1, uint32_t color2) {
    for (uint16_t i = 0; i < SEGMENT_LENGTH; i++) {
        if ((i + SEGMENT_RUNTIME.counter_mode_step) % 4 < 2) {
            if (SEGMENT.reverse) {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + i, color1);
            } else {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - i, color1);
            }
        } else {
            if (SEGMENT.reverse) {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + i, color2);
            } else {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - i, color2);
            }
        }
    }

    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) & 0x3;
    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * Alternating color/white pixels running.
 */
static uint16_t mode_running_color(void)
{
    return running(SEGMENT.colors[0], WHITE);
}

/*
 * Alternating red/blue pixels running.
 */
static uint16_t mode_running_red_blue(void)
{
    return running(RED, BLUE);
}

/*
 * Alternating red/green pixels running.
 */
static uint16_t mode_merry_christmas(void)
{
    return running(RED, GREEN);
}

/*
 * Alternating orange/purple pixels running.
 */
static uint16_t mode_halloween(void)
{
    return running(PURPLE, ORANGE);
}

/*
 * Random colored pixels running.
 */
static uint16_t mode_running_random(void)
{
    for (uint16_t i = SEGMENT_LENGTH - 1; i > 0; i--) {
        if (SEGMENT.reverse) {
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.stop - i,
                nsec_neoPixel_get_pixel_color(SEGMENT.stop - i + 1));
        } else {
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.start + i,
                nsec_neoPixel_get_pixel_color(SEGMENT.start + i - 1));
        }
    }

    if (SEGMENT_RUNTIME.counter_mode_step == 0) {
        SEGMENT_RUNTIME.aux_param =
            get_random_wheel_index(SEGMENT_RUNTIME.aux_param);
        if (SEGMENT.reverse) {
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.stop, color_wheel(SEGMENT_RUNTIME.aux_param));
        } else {
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.start, color_wheel(SEGMENT_RUNTIME.aux_param));
        }
    }

    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step == 0) ? 1 : 0;
    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * K.I.T.T.
 */
static uint16_t mode_larson_scanner(void)
{
    fade_out();

    if (SEGMENT_RUNTIME.counter_mode_step < SEGMENT_LENGTH) {
        if (SEGMENT.reverse) {
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.stop - SEGMENT_RUNTIME.counter_mode_step,
                SEGMENT.colors[0]);
        } else {
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.start + SEGMENT_RUNTIME.counter_mode_step,
                SEGMENT.colors[0]);
        }
    } else {
        if (SEGMENT.reverse) {
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.stop -
                    ((SEGMENT_LENGTH * 2) - SEGMENT_RUNTIME.counter_mode_step) +
                    2,
                SEGMENT.colors[0]);
        } else {
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.start +
                    ((SEGMENT_LENGTH * 2) - SEGMENT_RUNTIME.counter_mode_step) -
                    2,
                SEGMENT.colors[0]);
        }
    }

    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) % ((SEGMENT_LENGTH * 2) - 2);
    return (SEGMENT.speed / (SEGMENT_LENGTH * 2));
}

