nsec/nsec-badge/nrf52/src/drivers/ws2812fx.c
/*
 * Firing comets from one end.
 */
static uint16_t mode_comet(void)
{
    fade_out();

    if (SEGMENT.reverse) {
        nsec_neoPixel_set_pixel_color_packed(
            SEGMENT.stop - SEGMENT_RUNTIME.counter_mode_step,
            SEGMENT.colors[0]);
    } else {
        nsec_neoPixel_set_pixel_color_packed(
            SEGMENT.start + SEGMENT_RUNTIME.counter_mode_step,
            SEGMENT.colors[0]);
    }

    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) % SEGMENT_LENGTH;
    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * Fireworks function.
 */
uint16_t fireworks(uint32_t color) {
    fade_out();
    uint32_t prevLed, thisLed, nextLed;

    // set brightness(i) = ((brightness(i-1)/2 + brightness(i+1)) / 2) +
    // brightness(i)
    for (uint16_t i = SEGMENT.start + 1; i < SEGMENT.stop; i++) {
        // the new way. not as precise, but much faster, smaller and works with
        // RGBW leds
        prevLed = (nsec_neoPixel_get_pixel_color(i - 1) >> 2) & 0x3F3F3F3F;
        thisLed = nsec_neoPixel_get_pixel_color(i);
        nextLed = (nsec_neoPixel_get_pixel_color(i + 1) >> 2) & 0x3F3F3F3F;
        nsec_neoPixel_set_pixel_color_packed(i, prevLed + thisLed + nextLed);
    }

    if (!g_fx.triggered) {
        for (uint16_t i = 0; i < max(1, SEGMENT_LENGTH / 20); i++) {
            if (nsec_random_get_byte(9) == 0) {
                nsec_neoPixel_set_pixel_color_packed(
                    SEGMENT.start + nsec_random_get_byte(SEGMENT_LENGTH - 1),
                    color);
            }
        }
    } else {
        for (uint16_t i = 0; i < max(1, SEGMENT_LENGTH / 10); i++) {
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.start + nsec_random_get_byte(SEGMENT_LENGTH - 1),
                color);
        }
    }
    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * Firework sparks.
 */
static uint16_t mode_fireworks(void)
{
    uint32_t color = SEGMENT.colors[0];
    return fireworks(color);
}

/*
 * Random colored firework sparks.
 */
static uint16_t mode_fireworks_random(void)
{
    uint32_t color = color_wheel(nsec_random_get_byte(255));
    return fireworks(color);
}

/*
 * Fire flicker function
 */
uint16_t fire_flicker(int rev_intensity) {
    // byte w = (SEGMENT.colors[0] >> 24) & 0xFF;
    uint8_t r = (SEGMENT.colors[0] >> 16) & 0xFF;
    uint8_t g = (SEGMENT.colors[0] >> 8) & 0xFF;
    uint8_t b = (SEGMENT.colors[0] & 0xFF);
    uint8_t lum = max(r, max(g, b)) / rev_intensity;
    for (uint16_t i = SEGMENT.start; i <= SEGMENT.stop; i++) {
        int flicker = nsec_random_get_byte_range(0, lum - 1);
        nsec_neoPixel_set_pixel_color(i, max(r - flicker, 0),
                                      max(g - flicker, 0), max(b - flicker, 0));
    }
    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * Random flickering.
 */
static uint16_t mode_fire_flicker(void)
{
    return fire_flicker(3);
}

/*
 * Random flickering, less intensity.
 */
static uint16_t mode_fire_flicker_soft(void)
{
    return fire_flicker(6);
}

/*
 * Random flickering, more intensity.
 */
static uint16_t mode_fire_flicker_intense(void)
{
    return fire_flicker(1.7);
}

/*
 * Tricolor chase function
 */
uint16_t tricolor_chase(uint32_t color1, uint32_t color2, uint32_t color3) {
    for (uint16_t i = 0; i < SEGMENT_LENGTH; i++) {
        if ((i + SEGMENT_RUNTIME.counter_mode_step) % 6 < 2) {
            if (SEGMENT.reverse) {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + i, color1);
            } else {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - i, color1);
            }
        } else if ((i + SEGMENT_RUNTIME.counter_mode_step) % 6 < 4) {
            if (SEGMENT.reverse) {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + i, color2);
            } else {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - i, color2);
            }
        } else {
            if (SEGMENT.reverse) {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + i, color3);
            } else {
                nsec_neoPixel_set_pixel_color_packed(SEGMENT.stop - i, color3);
            }
        }
    }

    SEGMENT_RUNTIME.counter_mode_step =
        (SEGMENT_RUNTIME.counter_mode_step + 1) % 6;
    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * Tricolor chase mode
 */
static uint16_t mode_tricolor_chase(void)
{
    return tricolor_chase(SEGMENT.colors[0], SEGMENT.colors[1],
                          SEGMENT.colors[2]);
}

/*
 * Alternating white/red/black pixels running.
 */
static uint16_t mode_circus_combustus(void)
{
    return tricolor_chase(RED, WHITE, BLACK);
}

/*
 * ICU mode
 */
static uint16_t mode_icu(void)
{
    uint16_t dest = SEGMENT_RUNTIME.counter_mode_step & 0xFFFF;

    nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + dest,
                                         SEGMENT.colors[0]);
    nsec_neoPixel_set_pixel_color_packed(
        SEGMENT.start + dest + SEGMENT_LENGTH / 2, SEGMENT.colors[0]);

    if (SEGMENT_RUNTIME.aux_param == dest) { // pause between eye movements
        if (nsec_random_get_byte(5) == 0) {  // blink once in a while
            nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + dest, 0);
            nsec_neoPixel_set_pixel_color_packed(
                SEGMENT.start + dest + SEGMENT_LENGTH / 2, 0);
            return 200;
        }
        SEGMENT_RUNTIME.aux_param =
            nsec_random_get_byte((SEGMENT_LENGTH / 2) - 1);
        return 1000 + nsec_random_get_u16(1999);
    }

    nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + dest, 0);
    nsec_neoPixel_set_pixel_color_packed(
        SEGMENT.start + dest + SEGMENT_LENGTH / 2, 0);

    if (SEGMENT_RUNTIME.aux_param > SEGMENT_RUNTIME.counter_mode_step) {
        SEGMENT_RUNTIME.counter_mode_step++;
        dest++;
    } else if (SEGMENT_RUNTIME.aux_param < SEGMENT_RUNTIME.counter_mode_step) {
        SEGMENT_RUNTIME.counter_mode_step--;
        dest--;
    }

    nsec_neoPixel_set_pixel_color_packed(SEGMENT.start + dest,
                                         SEGMENT.colors[0]);
    nsec_neoPixel_set_pixel_color_packed(
        SEGMENT.start + dest + SEGMENT_LENGTH / 2, SEGMENT.colors[0]);

    return (SEGMENT.speed / SEGMENT_LENGTH);
}

/*
 * Custom mode
 */
static mode_func_t customMode = NULL;
static uint16_t mode_custom(void)
{
    if (customMode == NULL) {
        return 1000; // if custom mode not set, do nothing
    } else {
        return customMode();
    }
}

/*
 * Custom mode helper
 */
void setCustomMode(mode_func_t p)
{
    customMode = p;
}
